app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "passhash", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 11 Oct 2013 00:50:55 UTC +00:00], ["email", "alex.stoddard@comcast.net"], ["passhash", "abcdefg"], ["updated_at", Fri, 11 Oct 2013 00:50:55 UTC +00:00], ["username", "alex"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save